TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</name>
  <resources>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеКачества</name>
    <type>
      <types>EnumRef.гкс_СостоянияКачества</types>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользования</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияКачества/гкс_СостоянияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияКачества</name>
  <enumValues>
    <name>ОжиданиеОбщегоРезультата</name>
  </enumValues>
  <enumValues>
    <name>ОтборПроб</name>
  </enumValues>
  <enumValues>
    <name>ПробыНеТребуются</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоВходнойКонтроль</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Записать непринятые регистрации в регистр.
// 
// Параметры:
//  МассивНепринятыхРегистраций - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - Массив непринятых регистраций
//  Показатели - Массив из СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатели к обработке
//  СостояниеКачества - ПеречислениеСсылка.гкс_СостоянияКачества.НеПринятоВходнойКонтроль - Состояния качества
//
Процедура ЗаписатьНепринятыеРегистрацииВРегистр(МассивНепринятыхРегистраций, Показатели, СостояниеКачества) Экспорт
		
	// Получаем показатели для непринятых регистраций
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования КАК НазначениеИспользования
	|ИЗ
	|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
	|ГДЕ
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации В(&МассивНепринятыхРегистраций)
	|	И ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|	И ПоказателиУсиленногоКонтроляПоРегистрации.Показатель В(&Показатели)";

	Запрос.УстановитьПараметр("МассивНепринятыхРегистраций", МассивНепринятыхРегистраций);
	Запрос.УстановитьПараметр("Показатели", Показатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	// Записываем новое состояние для каждого показателя непринятых регистраций
	Пока Выборка.Следующий() Цикл

		НаборЗаписей = РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументРегистрации.Установить(Выборка.ДокументРегистрации);
		НаборЗаписей.Отбор.ЛабораторныйАнализ.Установить(Выборка.ЛабораторныйАнализ);
		НаборЗаписей.Отбор.Показатель.Установить(Выборка.Показатель);
		НаборЗаписей.Отбор.НазначениеИспользования.Установить(Выборка.НазначениеИспользования);

		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.СостояниеКачества = СостояниеКачества;
		КонецЦикла;   

		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

// Записывает показатель усиленного контроля по регистрации.
// Используется для создания записей при работе с промежуточным композитом.
// 
// Параметры:
//  ДанныеЗаписи - Структура, СтрокаТаблицыЗначений - данные для записи:
// * ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - документ регистрации
// * Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатель анализа
// * ЛабораторныйАнализ - ДокументСсылка.гкс_ЛабораторныйАнализ - документ анализа
// * СостояниеКачества - ПеречислениеСсылка.гкс_СостоянияКачества - состояние качества
//                  НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - назначение
//                  ТипПробы - ПеречислениеСсылка.гкс_ТипыПроб - тип пробы
//  ДополнительныеДанныеЗаполнения Дополнительные данные заполнения
//  Сутки - Неопределено - Сутки
Процедура ЗаписатьПоказательУКПоРегистрации(ДанныеЗаписи, ДополнительныеДанныеЗаполнения, Сутки) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДанныеЗаписи.ДокументРегистрации);
	НаборЗаписей.Отбор.Показатель.Установить(ДанныеЗаписи.Показатель);
	НаборЗаписей.Отбор.НазначениеИспользования.Установить(ДополнительныеДанныеЗаполнения.НазначениеИспользования);
	НаборЗаписей.Отбор.ТипПробы.Установить(ДополнительныеДанныеЗаполнения.ТипПробы);

	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Измерения
	НоваяЗапись.ДокументРегистрации = ДанныеЗаписи.ДокументРегистрации;
	НоваяЗапись.Показатель = ДанныеЗаписи.Показатель;
	НоваяЗапись.НазначениеИспользования = ДополнительныеДанныеЗаполнения.НазначениеИспользования;
	НоваяЗапись.ТипПробы = ДополнительныеДанныеЗаполнения.ТипПробы;

	// Ресурсы - копируем из исходных данных группы
	НоваяЗапись.ЗначениеПоказателяМин = ДанныеЗаписи.ЗначениеПоказателяМин;
	НоваяЗапись.ЗначениеПоказателяМакс = ДанныеЗаписи.ЗначениеПоказателяМакс;
	НоваяЗапись.Базис = ДанныеЗаписи.Базис;
	НоваяЗапись.ОтклонятьКачество = ДанныеЗаписи.ОтклонятьКачество;

	// Реквизиты - временные параметры создания	
	НоваяЗапись.МестнаяДата = Сутки;
	НоваяЗапись.ПроизводственныеСутки = Сутки;


	
	НаборЗаписей.Записать();

КонецПроцедуры

// Добавляет показатели УК для заблокированного ТС при не принятом качестве первого ТС
// Создаёт записи в РС ПоказателиУсиленногоКонтроляПоРегистрации для последующего
// прохождения промежуточного композита заблокированным ТС.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - заблокированная регистрация
//  ПоказателиНеПринято - Массив - массив показателей с не принятым качеством
//  ТочкаМаршрута - 
// Точка маршрута
//  ТипПробы Тип пробы
//  НазначениеИспользования Назначение использования
//  ДанныеПоказателейПервогоТС - Соответствие, Неопределено - показатель → Структура(Мин, Макс, Базис)
Процедура ДобавитьПоказателиУКДляЗаблокированногоТС(ДокументРегистрации, ПоказателиНеПринято, 
	ТочкаМаршрута, ТипПробы, НазначениеИспользования,
	ДанныеПоказателейПервогоТС = Неопределено) Экспорт


	НаборЗаписей = ПолучитьНаборЗаписейПоОтбору(ДокументРегистрации, ТипПробы, НазначениеИспользования);

	СуществующиеПоказатели = Новый Соответствие;
	Для Каждого Запись Из НаборЗаписей Цикл
		СуществующиеПоказатели.Вставить(Запись.Показатель, Истина);
	КонецЦикла;


	Для Каждого Показатель Из ПоказателиНеПринято Цикл

		Если СуществующиеПоказатели.Получить(Показатель) = Неопределено Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ДокументРегистрации = ДокументРегистрации;
			НоваяЗапись.Показатель = Показатель;
			НоваяЗапись.ТипПробы = Перечисления.гкс_ТипыПроб.Единичная;
			НоваяЗапись.НазначениеИспользования = 
				Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит;
			
			Если ДанныеПоказателейПервогоТС <> Неопределено Тогда
				ДанныеПервогоТС = ДанныеПоказателейПервогоТС.Получить(Показатель);
				Если ДанныеПервогоТС <> Неопределено Тогда
					НоваяЗапись.ЗначениеПоказателяМин = ДанныеПервогоТС.ЗначениеПоказателяМин;
					НоваяЗапись.ЗначениеПоказателяМакс = ДанныеПервогоТС.ЗначениеПоказателяМакс;
					НоваяЗапись.Базис = ДанныеПервогоТС.Базис;
					НоваяЗапись.ОтклонятьКачество = ДанныеПервогоТС.ОтклонятьКачество;
				КонецЕсли;
			КонецЕсли;
			
			// Реквизиты - временные параметры создания	
			МестнаяДата = Справочники.гкс_ТочкиМаршрута.
			ПолучитьМестнуюДатуПоТочкеМаршрута(ТочкаМаршрута);
			НоваяЗапись.МестнаяДата = МестнаяДата;
			НоваяЗапись.ПроизводственныеСутки = гкс_ПриемкаТранспорта.ПроизводственныеСуткиПоДата(МестнаяДата);
			
		КонецЕсли;

	КонецЦикла;

	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

// Устанавливает статус "Пробы не требуются" для композитных записей
// заблокированной регистрации. Вызывается при не принятом качестве по усиленному контролю,
// когда вместо группового анализа выполняется индивидуальная проверка каждого ТС.
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - заблокированная регистрация
//  ПоказателиНеПринято - Массив - массив показателей с не принятым качеством
//  ТипПробы - ПеречислениеСсылка.гкс_ТипыПроб - тип пробы для отбора записей
//  НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - назначение использования
Процедура УстановитьПробыНеТребуютсяДляКомпозитных(ДокументРегистрации, ПоказателиНеПринято,
		ТипПробы, НазначениеИспользования) Экспорт
	
	НаборЗаписей = ПолучитьНаборЗаписейПоОтбору(ДокументРегистрации, ТипПробы, НазначениеИспользования);
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ПоказателиНеПринято.Найти(Запись.Показатель) <> Неопределено 
			И Не ЗначениеЗаполнено(Запись.СостояниеКачества) Тогда
			Запись.СостояниеКачества = Перечисления.гкс_СостоянияКачества.ПробыНеТребуются;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры


Процедура ОчиститьСостояниеКачестваДляКомпозитных(ДокументРегистрации, ПоказателиНеПринято,
		ТипПробы, НазначениеИспользования) Экспорт
	
	НаборЗаписей = ПолучитьНаборЗаписейПоОтбору(ДокументРегистрации, ТипПробы, НазначениеИспользования);
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ПоказателиНеПринято.Найти(Запись.Показатель) <> Неопределено 
			И Запись.СостояниеКачества = Перечисления.гкс_СостоянияКачества.ПробыНеТребуются Тогда
			Запись.СостояниеКачества = Перечисления.гкс_СостоянияКачества.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

// Создаёт и возвращает набор записей с установленными отборами.
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - документ регистрации
//  ТипПробы - ПеречислениеСсылка.гкс_ТипыПроб - тип пробы
//  НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - назначение
//
// Возвращаемое значение:
//  РегистрСведенийНаборЗаписей.гкс_ПоказателиУсиленногоКонтроляПоРегистрации - прочитанный набор записей
Функция ПолучитьНаборЗаписейПоОтбору(ДокументРегистрации, ТипПробы, НазначениеИспользования)
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);
	НаборЗаписей.Отбор.ТипПробы.Установить(ТипПробы);
	НаборЗаписей.Отбор.НазначениеИспользования.Установить(НазначениеИспользования);
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей;
	
КонецФункции

// Обработчик обновления регистра
Процедура ЗаполнитьПризнакОтклонятьКачество(Параметры = Неопределено) Экспорт
	
	СобытиеЖурнала = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
		
	Запрос = Новый Запрос;
	Запрос.Текст =	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО ПоказателиУсиленногоКонтроляПоРегистрации.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|ГДЕ
		|	ПоказателиАнализовНоменклатуры.гкс_ПриОтклоненииОтНормыОтклонятьКачество
		|	И ПоказателиАнализовНоменклатуры.гкс_ПриОтклоненииОтНормыОтклонятьКачество <> ПоказателиУсиленногоКонтроляПоРегистрации.ОтклонятьКачество";  

	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоОбновленных = 0;
	НаборЗаписей = РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации.СоздатьНаборЗаписей();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка      
			НаборЗаписей.Отбор.Показатель.Установить(Выборка.Показатель);
			НаборЗаписей.Прочитать();
            Для Каждого Запись Из НаборЗаписей Цикл
				Запись.ОтклонятьКачество = Истина;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КоличествоОбновленных = КоличествоОбновленных + 1;
			ЗафиксироватьТранзакцию();
    	Исключение
			ОтменитьТранзакцию();
			ИнфоОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать запись регистра Показатели усиленного контроля по регистрации
				|по причине: %1'"), ПодробноеПредставление);
			ЗаписьЖурналаРегистрации(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации, , ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	ТекстСообщенияУспех = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обновлено записей в РС Показатели усиленного контроля по регистрации: %1.'"), КоличествоОбновленных);
	ЗаписьЖурналаРегистрации(
		СобытиеЖурнала, УровеньЖурналаРегистрации.Информация,
		Метаданные.РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации, , ТекстСообщенияУспех);
		
КонецПроцедуры

#КонецОбласти   

#КонецЕсли
